package com.prance.lib.teacher.base.http

/**
 * Created by shenbingbing on 16/4/22.
 */
object StatusConstant {

    /**
     * 成功返回值
     */
    val SUCCESS = 200

    val QRCODE_TIMEOUT = 40004

    val QRCODE_DEPRECATED = 40005


//    200 操作成功
//    400 操作失败
//    401 该操作未经授权
//    40001 用户未登录，请登录
//    40002 发送验证码失败
//    40003 发送二维码失败
//    40004  二维码已超时
//    40005 二维码已被扫描
//    40006 登陆失败
//    40007 获取用户信息失败
//    40008 获取班级列表失败
//    40009 签到失败
//    40010 获取学生列表失败
//    40011 获取签到列表失败
//    40012 绑定答题器失败
//    40013 替换答题器失败
//    40014 获取课次列表失败
//    40015 创建二维码失败
//    40016 token验证失败
//    40017 扫描二维码超时
//    40018 二维码未被扫描
}
